org/info/game-repos.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<!-- 2016-01-19 火 11:46 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>ソフトウェア構成論 game.repos</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="masayuki suzuki@cis.iwate-u.ac.jp" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://wiki.cis.iwate-u.ac.jp/~suzuki/org-html-theme/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">ソフトウェア構成論 game.repos</h1>
<div id="table-of-contents">
<h2>&#30446;&#27425;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline5">game開発用 リポジトリ</a>
<ul>
<li><a href="#orgheadline1">リポジトリについて</a></li>
<li><a href="#orgheadline4">の内容</a>
<ul>
<li>
<ul>
<li><a href="#orgheadline2">card</a></li>
<li><a href="#orgheadline3">deck</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<a href="http://wiki.cis.iwate-u.ac.jp/~suzuki/lects/prog/index.html">ソフト
ウェア構成論</a> /
<a href="http://wiki.cis.iwate-u.ac.jp/~suzuki/lects/prog/lects/">毎回の講義</a>
/  <a href="http://wiki.cis.iwate-u.ac.jp/~suzuki/lects/prog/org-docs/">講義
ドキュメント</a> /
<a href="http://wiki.cis.iwate-u.ac.jp/~suzuki/lects/prog/org-docs/poker/">ポー
カーゲームの開発</a> /
<a href="http://wiki.cis.iwate-u.ac.jp/~suzuki/lects/prog/info/game-repos.html">repos</a> /
<a href="http://wiki.cis.iwate-u.ac.jp/~suzuki/lects/prog/lects/supplyments/">講義補足</a>
</p>
<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5">game開発用 リポジトリ</h2>
<div class="outline-text-2" id="text-orgheadline5">
</div><div id="outline-container-orgheadline1" class="outline-3">
<h3 id="orgheadline1">リポジトリについて</h3>
<div class="outline-text-3" id="text-orgheadline1">
<p>
バージョン管理ソフト subversion のリポジトリに，game 開発ディレクト
リ全体を置きました。
</p>

<p>
リポジトリは，ブラウザから閲覧できます:
</p>
<ul class="org-ul">
<li>URLは，<a href="https://wiki.cis.iwate-u.ac.jp/svn/prog/">https://wiki.cis.iwate-u.ac.jp/svn/prog/</a> です。</li>
<li>認証が必要です。学科計算機のログイン名とパスワードを使ってください。</li>
<li>安全でないサイトへの接続とみなされますが，例外として登録してくださ
い。</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><a href="https://wiki.cis.iwate-u.ac.jp/svn/prog/2015/progs/game">https://wiki.cis.iwate-u.ac.jp/svn/prog/2015/progs/game</a> の内容</h3>
<div class="outline-text-3" id="text-orgheadline4">
</div><div id="outline-container-orgheadline2" class="outline-5">
<h5 id="orgheadline2"><a href="https://wiki.cis.iwate-u.ac.jp/svn/prog/2015/progs/game/card">card</a></h5>
<div class="outline-text-5" id="text-orgheadline2">
<ul class="org-ul">
<li><a href="https://wiki.cis.iwate-u.ac.jp/svn/prog/2015/progs/game/card/test">card/test</a>
<ul class="org-ul">
<li><a href="https://wiki.cis.iwate-u.ac.jp/svn/prog/2015/progs/game/card/test/Makefile">card/test/Makefile</a></li>
<li><a href="https://wiki.cis.iwate-u.ac.jp/svn/prog/2015/progs/game/card/test/test_card.c">card/test/test_card.c</a></li>
</ul></li>
<li><a href="https://wiki.cis.iwate-u.ac.jp/svn/prog/2015/progs/game/card/src">card/src</a>
<ul class="org-ul">
<li><a href="https://wiki.cis.iwate-u.ac.jp/svn/prog/2015/progs/game/card/src/Makefile">card/src/Makefile</a></li>
<li><a href="https://wiki.cis.iwate-u.ac.jp/svn/prog/2015/progs/game/card/src/card.h">card/src/card.h</a></li>
<li><a href="https://wiki.cis.iwate-u.ac.jp/svn/prog/2015/progs/game/card/src/card.c">card/src/card.c</a></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-5">
<h5 id="orgheadline3"><a href="https://wiki.cis.iwate-u.ac.jp/svn/prog/2015/progs/game/deck">deck</a></h5>
<div class="outline-text-5" id="text-orgheadline3">
<ul class="org-ul">
<li><a href="https://wiki.cis.iwate-u.ac.jp/svn/prog/2015/progs/game/deck/test">deck/test</a>
<ul class="org-ul">
<li><a href="https://wiki.cis.iwate-u.ac.jp/svn/prog/2015/progs/game/deck/test/Makefile">deck/test/Makefile</a></li>
<li><a href="https://wiki.cis.iwate-u.ac.jp/svn/prog/2015/progs/game/deck/test/test_deck.c">deck/test/test_deck.c</a></li>
</ul></li>
<li><a href="https://wiki.cis.iwate-u.ac.jp/svn/prog/2015/progs/game/deck/src">deck/src</a>
<ul class="org-ul">
<li><a href="https://wiki.cis.iwate-u.ac.jp/svn/prog/2015/progs/game/deck/src/Makefile">deck/src/Makefile</a></li>
<li><a href="https://wiki.cis.iwate-u.ac.jp/svn/prog/2015/progs/game/deck/src/deck.h">deck/src/deck.h</a></li>
<li><a href="https://wiki.cis.iwate-u.ac.jp/svn/prog/2015/progs/game/deck/src/deck.c">deck/src/deck.c</a></li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">&#33879;&#32773;: masayuki suzuki@cis.iwate-u.ac.jp</p>
<p class="date">Created: 2016-01-19 火 11:46</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
